天干=("甲","乙","丙","丁","戊","己","庚","辛","壬","癸")
地支=("子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥")

for i in range(0,59):
    print(天干[i%10],地支[i%12])
九宫 = (0,4,9,2,3,5,7,8,1,6)
for i in range(0,9):
    if i%3 ==0 :
        print("\n")
    print(九宫[i])
print(f"{九宫[1]} {九宫[2]} {九宫[3]}\n{九宫[4]} {九宫[5]} {九宫[6]}\n{九宫[7]} {九宫[8]} {九宫[9]}\n")
遁甲 = ("戊","己","庚","辛","壬","癸","丁","丙","乙")

tmp = [0,4,9,2,3,5,7,8,1,6]
for i in range (1,10):

    for t in range(1,10):
        if 九宫[t]==i:
            tmp[t]=遁甲[i-1]

print(f"{tmp[1]} {tmp[2]} {tmp[3]}\n{tmp[4]} {tmp[5]} {tmp[6]}\n{tmp[7]} {tmp[8]} {tmp[9]}\n")
